### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_service.default[0] has changed
  ~ resource "aws_ecs_service" "default" {
      ~ desired_count                      = 1 -> 3
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:6" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "dev" -> "f9cef4d298591692f8b03a9ec5e5609ea2175551"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "false"
                        },
                        # (7 unchanged elements hidden)
                    ]
                    name                   = "api"
                    # (10 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ environment            = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "dev" -> "f9cef4d298591692f8b03a9ec5e5609ea2175551"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
                    name                   = "datadog"
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_ssm_parameter.postgres_connection_string[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "postgres_connection_string" {
-       allowed_pattern = "" -> null
        id              = "/gost/staging/postgres/connection_string"
+       insecure_value  = (known after apply)
        name            = "/gost/staging/postgres/connection_string"
        tags            = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.postgres.random_password.postgres_user will be created
+   resource "random_password" "postgres_user" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-staging-grants_scraper-2023021701041523320000000b:terraform-20230217010528091000000012"
        name   = "terraform-20230217010528091000000012"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-staging-grants_scraper-20230217010528095600000013"
        name                         = "gost-staging-grants_scraper-20230217010528095600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:6" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.postgres.module.db.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "gost-staging-postgres-20230217010405040800000006"
      ~ master_password                     = (sensitive value)
        tags                                = {}
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres.module.db.aws_security_group_rule.default_ingress[0] will be destroyed
  # (because aws_security_group_rule.default_ingress is not in configuration)
-   resource "aws_security_group_rule" "default_ingress" {
-       description              = "From allowed SGs" -> null
-       from_port                = 5432 -> null
-       id                       = "sgrule-2587635984" -> null
-       protocol                 = "tcp" -> null
-       security_group_id        = "sg-0b1895f711684bb06" -> null
-       security_group_rule_id   = "sgr-0cb117703f8cd6b2f" -> null
-       self                     = false -> null
-       source_security_group_id = "sg-09b90196ed40630de" -> null
-       to_port                  = 5432 -> null
-       type                     = "ingress" -> null
    }

  # module.postgres.module.db.aws_security_group_rule.this["from_api"] will be created
+   resource "aws_security_group_rule" "this" {
+       from_port                = 5432
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = "sg-0b1895f711684bb06"
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = "sg-09b90196ed40630de"
+       to_port                  = 5432
+       type                     = "ingress"
    }

  # module.postgres.module.db.random_password.master_password[0] will be destroyed
  # (because random_password.master_password is not in configuration)
-   resource "random_password" "master_password" {
-       bcrypt_hash = (sensitive value)
-       id          = "none" -> null
-       length      = 10 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = (sensitive value)
-       special     = false -> null
-       upper       = true -> null
    }

Plan: 3 to add, 5 to change, 3 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*